[
    {
        "id": "1",
        "image": "https://www.oxfordwebstudio.com/user/pages/06.da-li-znate/sta-je-html/sta-je-html.jpg",
        "name": "HTML",
        "lessons": "53",
        "video_length": "5:43:36",
        "price": "18",
        "description": "HTML: HyperText Markup Language HTML (HyperText Markup Language) is the most basic building block of the Web. It defines the meaning and structure of web content. Other technologies besides HTML are generally used to describe a web page's appearance/presentation (CSS) or functionality/behavior (JavaScript). An HTML element is set off from other text in a document by 'tags', which consist of the element name surrounded by '<' and '>'. The name of an element inside a tag is case insensitive. That is, it can be written in uppercase, lowercase, or a mixture. For example, the <title> tag can be written as <Title>, <TITLE>, or in any other way. However, the convention and recommended practice is to write tags in lowercase.",
        "about": [
            "Html is the simplest language that can be easily understood and modified.",
            "It gives the flexibility to design the web pages so that a structured display can be possible for all listed documents on the web pages.",
            "Formatting tags could be used for effective presentations in the web portal, and it could possibly because of HTML.",
            "Multiple links can be added to the web page to redirect to other pages using listed links easily.",
            "The most important part of HTML is, it can be displayed in Macintosh, Windows, and Linux and support all environments. Html is platform-independent."
        ],
        "instructor": "Dan Wellman is an author and front-end developer based in the south of England. By day he builds web sites and applications and likes to focus on JavaScript, testing and workflow tools. By night he produces video courses for Envato Tuts+ on a range of mostly front-end focused topics, usually centered around JavaScript. You can check out his website, follow him on Twitter, and see his profile on GitHub."
    },
    {
        "id": "2",
        "image": "https://colorlib.com/wp/wp-content/uploads/sites/2/creative-css3-tutorials.jpg",
        "name": "CSS",
        "lessons": "15",
        "video_length": "1:44:22",
        "price": "25",
        "description": "Cascading Style Sheets, which is better known as CSS, is a very simple designed process used to make the web pages a lot more presentable. CSS allows you to put styles to customize your web pages. The best part about making use of this styling feature is that the CSS is independent of the HTML way of creating web pages. The basic difference between the Hypertext Markup Language and the Cascading Style Sheets is that the former is mainly known to provide the structural way of the landscape to the web page while the former is meant to provide powerful color coding and styling techniques. It is used to control the layout of more than one web page all at once. All the external stylesheets are stored in the form of CSS files.",
        "about": [
            "A style rule consists of a selector component and a declaration block component.",
            "The selector is used to point to the HTML component which you want to get styled.",
            "Inside the declaration block, one or more declarations are contained along with semicolons.",
            "Every declaration which is put has a CSS property name, a semicolon, and a value. For example, color is the property, and the value is red in color. Font size is the property, and the 15px is the value.",
            "CSS declaration ends with a semicolon, and these blocks are surrounded by curly braces.",
            "How to use primitive data types and create objects."
        ],
        "instructor": "Jeremy McPeak started his development career on the client side, writing JavaScript and DHTML components in his spare time. He has co-written several books, such as Professional Ajax 1st Edition, Professional Ajax 2nd Edition, and Beginning JavaScript 3rd and 4th editions. You can check out his website or follow him on Google+."
    },
    {
        "id": "3",
        "image": "https://user-images.githubusercontent.com/65357821/82758846-0394c180-9e0f-11ea-8b02-51f885eff3f5.png",
        "name": "JavaScript",
        "lessons": "39",
        "video_length": "1:38:06",
        "price": "35",
        "description": "The following article provides a detailed outline of the features of JavaScript. Java Script was developed by Brendan Eich in Netscape in 1995 for coding in web pages allowing the logical operation to client edge. JavaScript is mainly a client edge script language. This object-centered script language most commonly used for designing web pages which are a standalone language developed in Netscape. It gives the user extra control over the browser with potential in the creation of new functions in scripts. This scripting language features case sensitive input with the detection of the user’s browser and operating system. JavaScript is mostly used by validation in client edge technology.",
        "about": [
            "Object-Centered Script Language",
            "Client edge Technology",
            "Validation of User’s Input",
            "Else and If Statement",
            "Interpreter Centered",
            "Ability to perform In Built Function",
            "Case Sensitive format",
            "Light Weight and delicate",
            "Statements Looping",
            "Handling Events"
        ],
        "instructor": "Jason Rhodes is a Javascript developer in Baltimore, Maryland, USA.You can connect with him on Twitter or GitHub."
    },
    {
        "id": "4",
        "image": "https://www.atatus.com/blog/content/images/2022/06/Tailwind-CSS-vs.-Bootstrap.jpeg",
        "name": "Bootstarp & Tailwind",
        "lessons": "20",
        "video_length": "1:52:29",
        "price": "9",
        "description": "Bootstrap is a component-based framework, which means it comes with prebuilt components and includes other utilities for layering displays, spacing, etc. Tailwind, on the other hand, CSS is a utility-first framework. Using Tailwind CSS is akin to writing regular CSS. Unlike Bootstrap, it has no prebuilt components.",
        "about": [
            "Bootstrapping Is Not a Source of Funding.",
            "Bootstrapping Is a Discipline.",
            "Bootstrapping Is a Journey and Never a Sprint.",
            "Tailwind is Highly Customizable",
            "Tailwind Has Common Utility Patterns",
            "Tailwind Can Be Optimized Using PurgeCSS"
        ],
        "instructor": "Dan Wellman is an author and front-end developer based in the south of England. By day he builds web sites and applications and likes to focus on JavaScript, testing and workflow tools. By night he produces video courses for Envato Tuts+ on a range of mostly front-end focused topics, usually centered around JavaScript. You can check out his website, follow him on Twitter, and see his profile on GitHub."
    },
    {
        "id": "5",
        "image": "https://www.softwaretestinghelp.com/wp-content/qa/uploads/2020/12/Python-Programming.png",
        "name": "Python",
        "lessons": "60",
        "video_length": "1:38:01",
        "price": "35",
        "description": "Python is a famous programming framework known for its simple object-oriented characteristic advantage. A few of Python’s other notable features are the library functions & modules are reliable in nature and facilitate the developers with its interactive mode. It also supports other program theories, provides dynamic code check for types, easy access for database applications, user interface programming is quite uncomplicated, anyone can get their hand on python programming as it is available for free & open source. It consents to expandability & scalability, and finally, the most important feature is it is effortless to self-learn, understand & write the code.",
        "about": [
            "Supports Various Programming Paradigms",
            "Support for Interactive Mode",
            "Automatic Garbage Collection",
            "Dynamically Typed and Type Checking",
            "GUI Programming"
        ],
        "instructor": "Jeremy McPeak started his development career on the client side, writing JavaScript and DHTML components in his spare time. He has co-written several books, such as Professional Ajax 1st Edition, Professional Ajax 2nd Edition, and Beginning JavaScript 3rd and 4th editions. You can check out his website."
    },
    {
        "id": "6",
        "image": "https://miro.medium.com/max/1050/1*i3hzpSEiEEMTuWIYviYweQ.png",
        "name": "React",
        "lessons": "53",
        "video_length": "2:10:25",
        "price": "30",
        "description": "Currently, ReactJS gaining quick popularity as the best JavaScript framework among web developers. It is playing an essential role in the front-end ecosystem. The important features of ReactJS are as following.",
        "about": [
            "JSX",
            "Components",
            "One-way Data Binding",
            "Virtual DOM",
            "Simplicity",
            "Performance"
        ],
        "instructor": "Dan Wellman is an author and front-end developer based in the south of England. By day he builds web sites and applications and likes to focus on JavaScript, testing and workflow tools. By night he produces video courses for Envato Tuts+ on a range of mostly front-end focused topics, usually centered around JavaScript. You can check out his website, follow him on Twitter, and see his profile on GitHub."
    }
]